/* 
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */



$(document).ready(function(){
    var arrNames= new Array("Александр","Александра","Алексей","Алена","Алесь","Алеся","Алёна","Али","Алина","Алиса","Алла","Анастасия","Анатолий","Ангелина","Андрей","Анжелика","Ани ","Аниса","Анна","Антон","Антонина","Арменуи","Арсений","Артем","Артём ","Артур","Бажена","Вадим","Валентин","Валентина ","Валерий","Валерия","Варвара","Василиса","Вера ","Вероника","Виктор","Виктория","Виолетта ","Вита","Виталий","Виталия","Влада","Владимир","Владислав","Владлена","Галина ","Геннадий","Георгий","Глеб","Гражина","Григорий","Дарина","Дарья","Денис","Диана","Дина","Дмитрий","Евгений","Евгения","Егор","Екатерина","Елена","Елизавета","Иван","Игорь","Илона","Илья","Инга","Инесса","Инна","Ирина ","Карина","Катарина","Кира","Кирилл","Клавдия","Константин","Кристина","Ксения","Ксенья","Лариса","Леонид","Леонилла","Лиана","Лидия","Лилия","Любовь","Людмила","Ляля","Максим","Маргарита","Марина","Мария","Марк","Мечислав","Милана","Михаил","Надежда","Назар ","Наталия","Наталья","Неля","Никита","Николай","Николета","Николь","Нина","Оксана","Олег","Олеся","Ольга","Павел","Павлина","Полина","Радмила","Регина","Роберт","Роза","Роман","Руслан","Сабина","Саломе","Светлана","Святослав","Семён","Сергей","Снежанна","Станислав","Степан","Тамара","Татьяна","Тереза","Тимофей","Тимур","Ульяна","Фёдор","Фидана","Филипп","Христина","Хэди","Эдуард","Элеонора","Элла","Юлия","Юльян","Юрий","Ян","Яна ","Янина","Янна","Ярослава");
    var arrMides= new Array("Амирановна","Геннадьевна","Александрович","Александровна","Алексеевич","Алексеевна","Альбертович","Альбертовна","Альфредовна","Амирановна","Ананьевна","Анатольевич","Анатольевна","Андреевич","Андреевна","Антонович","Аркадьевна","Арманович","Артурович","Артуровна","Атикулловна","Борисовна","Вадимович","Вадимовна","Валентинович","Валентиновна","Валерьевич","Валерьевна","Валиевна","Васильевич","Васильевна","Вацлавовна","Викентьевна","Викторович","Викторовна","Висангиреевна","Витальевич","Витальевна","Витольдович","Владимирович","Владимировна","Владиславовна","Вячеславович","Вячеславовна","Геннадиевна","Геннадьевич","Геннадьевна","Генриховна","Георгиевна","Григорьевич","Григорьевна","Дионисович","Дмитриевич","Дмитриевна","Евгеньевич","Евгеньевна","Иванович","Ивановна","Игоревич","Игоревна","Иджрановна","Ильясовна","Иосифовна","Керимовна","Клавдиевна","Константинович","Константиновна","Леонидович","Леонидовна","Леоновна","Леонтьевна","Львовна","Людвиковна","Мазахировна","Максимович","Максимовна","Марковна","Марьяновна","Мехдиевич","Мечиславовна","Михайлович","Михайловна","Николаевич","Николаевна","Олегович","Олеговна","Павлович","Павловна","Петрович","Петровна","Раймондсовна","Рамазовна","Рамизовна","Ришардовна","Романовна","Ростиславович","Русланович","Руслановна","Светославовна","Святославовна","Семёнович","Сергеевич","Сергеевна","Сереевна","Станиславович","Станиславовна","Степановна","Тадеушевич","Тадеушевна","Фазаиловна","Фаязовна","Федорович","Федоровна","Фёдорович","Харесовна","Чеславовна","Эдуардович","Эдуардовна","Юрьевич","Юрьевна","Яновна","Ярославович");
    
    $('#name').autocomplete(
        arrNames
        );
   $('#midname').autocomplete(
   arrMides
    );
    
    $('#f_name').autocomplete(
        arrNames
        );
   $('#f_midname').autocomplete(
   arrMides
    );
   $('#m_name').autocomplete(
        arrNames
        );
   $('#m_midname').autocomplete(
   arrMides
    );
            
   $('#uzo_data').autocomplete(
   ['УЗО Брестского облисполкома',
'УЗО Витебского облисполкома',
'УЗО Гомельского облисполкома',
'УЗО Гродненского облисполкома',
'УЗО Минского облисполкома',
'УЗО Могилёвского облисполкома',
'ТПРУП "Минская фармация"',
'Брестское ТПРУП "Фармация"',
'Витебское ТПРУП "Фармация"',
'Гомельское ТПРУП "Фармация"',
'Гродненское ТПРУП "Фармация"',
'Могилёвское ТПРУП "Фармация"']
);
        
});